<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [491]:
import pandas as pd
import psycopg2

In [492]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [494]:
# текст запроса
# извлечь количество строк во всех столбцах в таблице vacancies
query_3_1 = f'''select count(*) 
                from vacancies 
             '''

In [495]:
# результат запроса
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql(query_3_1, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1681153250.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [496]:
# текст запроса
query_3_2 = f'''select count(*) 
                from employers 
             '''

In [497]:
# результат запроса
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql(query_3_2, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1490334083.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [498]:
# текст запроса
query_3_3 = f'''select count(*) 
                from areas 
            '''

In [499]:
# результат запроса
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql(query_3_3, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1994073323.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [500]:
# текст запроса
query_3_4 = f'''select count(*) 
                from industries 
            '''

In [501]:
# результат запроса
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql(query_3_4, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\3615467881.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_3_4, connection)

   count
0    294

***

In [502]:
# выводы по предварительному анализу данных
# Предварительный анализ данных позволил оценить количество вакансий (49 197), число работодателей (23 501), городов (1 362) и направлений деятельности работодателей (294) в представленной базе данных.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [503]:
# текст запроса
query_4_1 = f'''select count(v.id) cnt, 
                       a.name area 
                from vacancies v 
                    join areas a on a.id = v.area_id 
                group by 2 
                order by 1 desc 
                limit 5 
            '''

In [504]:
# результат запроса
df = pd.read_sql(query_4_1, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\32440790.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [505]:
# текст запроса
query_4_2 = f'''select count(*)
                from vacancies
                where salary_from is not null or salary_to is not null 
            '''

In [506]:
# результат запроса
df = pd.read_sql(query_4_2, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\722403366.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [507]:
# текст запроса
query_4_3 = f'''select 
                     avg(salary_from) "нижняя граница зарплатной вилки",
                     avg(salary_to) "верхняя граница зарплатной вилки" 
                from vacancies'''

In [508]:
# результат запроса
df = pd.read_sql(query_4_3, connection).round()
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2605779758.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_4_3, connection).round()

   нижняя граница зарплатной вилки  верхняя граница зарплатной вилки
0                          71065.0                          110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [509]:
# текст запроса
query_4_4 = f'''select 
                     count(id), 
                     schedule, 
                     employment 
                from vacancies
                group by 2, 3 
                order by 1 desc 
             '''

In [510]:
# результат запроса
df = pd.read_sql(query_4_4, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\777955492.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_4_4, connection)

    count          schedule           employment
0   35367       Полный день     Полная занятость
1    7802  Удаленная работа     Полная занятость
2    1593     Гибкий график     Полная занятость
3    1312  Удаленная работа  Частичная занятость
4     940    Сменный график     Полная занятость
5     569       Полный день           Стажировка
6     367    Вахтовый метод     Полная занятость
7     347       Полный день  Частичная занятость
8     312     Гибкий график  Частичная занятость
9     141       Полный день     Проектная работа
10    133  Удаленная работа     Проектная работа
11    116     Гибкий график           Стажировка
12    101    Сменный график  Частичная занятость
13     64  Удаленная работа           Стажировка
14     18     Гибкий график     Проектная работа
15     12    Сменный график           Стажировка
16      2    Вахтовый метод     Проектная работа
17      1    Сменный график     Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [511]:
# текст запроса
query_4_5 = f'''select 
                     count(id), 
                     experience 
                from vacancies
                where experience is not null 
                group by 2 
                order by 1 
              '''

In [512]:
# результат запроса
df = pd.read_sql(query_4_5, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2614203215.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_4_5, connection)

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

In [513]:
# выводы по детальному анализу вакансий
# На основании детального анализа представленной базы данных можно сделать следующие выводы:
# пятерка городов с наибольшим количеством вакансий (в порядке убывания) - Москва, Санкт_Петербург, Минск, Новосибирск и Алматы;
# из анализируемых вакансий хотя бы одна из границ зарплатной вилки представлена меньше, чем у половины;
# при этом средние верхняя и нижняя границы составляют 110 537 и 71 065 рублей, соответственно;
# наиболее популярным соотношением типа рабочего графика и трудоустройства является "полный рабочий день - полная занятость";
# самый распространенный вариант опыта работы - от 1 года до 3 лет, а наименее востребованный - более 6 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [514]:
# текст запроса
query_5_1 = f'''(select 
                     e.name, 
                     count(v.id) 
                from employers e
                    join vacancies v on e.id = v.employer_id 
                group by 1 
                order by 2 desc 
                limit 1)
                union all 
                (select 
                     e.name,
                     count(v.id)
                from employers e
                    join vacancies v on e.id = v.employer_id
                group by 1
                order by 2 desc
                offset 4 limit 1)'''

In [515]:
# результат запроса
df = pd.read_sql(query_5_1, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\3870053994.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_1, connection)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [516]:
# текст запроса
query_5_2 = f'''select
                    a.name "регион",
                    count(distinct e.id) "количество работодателей",
                    count(distinct v.id) "количество вакансий"
                from areas a
                    left join vacancies v on a.id = v.area_id
                    left join employers e on e.area = a.id 
                where v.id is null 
                group by 1
                order by 2 desc
                limit 1
             '''

In [517]:
# результат запроса
df = pd.read_sql(query_5_2, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\3424615294.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_2, connection)

   регион  количество работодателей  количество вакансий
0  Россия                       410                    0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [518]:
# текст запроса
query_5_3 = f'''select 
                     e.name,
                     count(distinct v.area_id)
                from employers e
                    join vacancies v on v.employer_id = e.id
                group by 1
                order by 2 desc
                '''

In [519]:
# результат запроса
df = pd.read_sql(query_5_3, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2221656222.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [520]:
# текст запроса
query_5_4 = f'''select 
                    count(distinct e.id)
                from employers_industries ei
                    right join employers e on ei.employer_id = e.id
                where ei.industry_id is null
             '''

In [521]:
# результат запроса
df = pd.read_sql(query_5_4, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2290075093.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [522]:
# текст запроса
query_5_5 = f'''select 
                    e.name,
                    count(ei.industry_id)
                from employers_industries ei
                    join employers e on ei.employer_id = e.id
                group by 1
                having count(ei.industry_id) = 4
                order by 1
                offset 2 limit 1
            '''

In [523]:
# результат запроса
df = pd.read_sql(query_5_5, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\3390285206.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [524]:
# текст запроса
query_5_6 = f'''select 
                    count(*)
                from employers e
                    left join employers_industries ei on ei.employer_id = e.id
                    join industries i on ei.industry_id = i.id
                where i.name like 'Разработка программного обеспечения'
            '''

In [525]:
# результат запроса
df = pd.read_sql(query_5_6, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1738411132.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [526]:
# код для получения списка городов-милионников
import urllib.parse as req
import requests
path_common = req.urlparse('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров')
url = path_common.scheme + '://' + req.quote(path_common.netloc) + req.quote(path_common.path) + '#'+ req.quote(path_common.fragment)
response = requests.get(url)
cities_mln = tuple(pd.read_html(url)[1]['Город'])
print(cities_mln)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград')

In [527]:
# текст запроса
query_5_7 = f'''with x as (
select a.name "регион",
       count(*) "количество вакансий"
from vacancies v
     join employers e on e.id = v.employer_id
     join areas a on a.id = v.area_id
group by v.area_id, a.name, e.id, e.name
having a.name in {cities_mln} and e.name = 'Яндекс'
)
select *
from x

union all
select 'Total',
        sum(x."количество вакансий")
from x
'''

In [528]:
# результат запроса
df = pd.read_sql(query_5_7, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\372883542.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_5_7, connection)

             регион  количество вакансий
0            Москва                 54.0
1   Санкт-Петербург                 42.0
2      Екатеринбург                 39.0
3       Новосибирск                 35.0
4         Волгоград                 24.0
5           Воронеж                 32.0
6         Краснодар                 30.0
7        Красноярск                 23.0
8   Нижний Новгород                 36.0
9              Омск                 21.0
10            Пермь                 25.0
11   Ростов-на-Дону                 25.0
12           Самара                 26.0
13           Казань                 25.0
14              Уфа                 26.0
15        Челябинск                 22.0
16            Total                485.0

***

In [529]:
# выводы по анализу работодателей
# По итогам проведенного анализа работодателей в представленной выборке можно сделать следующие выводы:
# 1. Наибольшее количество вакансий в Яндекс, пятерку лидеров по данному показателю замыкает Газпром нефть;
# 2. Название регионов включает не только название городов, но и стран, в которых они находятся. Отсюда несовсем корректная информация о регионе с наибольшим количеством работодателей, при этом отсутствии вакансий (Россия);
# 3. Работодалелем представленным в наибольшем количестве регионов является Яндекс (181 регион);
# 4. Достаточно большое количество работодателей не указывают свою сферу деятельности (8 419);
# 5. Однако некоторые компании указывают более 1 сферы деятельности;
# 6. В сфере "Разработка программного обеспечения" функционируют 3 553 компании;
# 7. Компания "Яндекс" предоставляет вакансии во всех городах-миллиониках России, их общее количество достигает 485.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [530]:
# текст запроса
query_6_1 = f'''select 
                     count(*)
                from vacancies
                where name ilike '%data%' or name ilike '%данн%'
             '''

In [531]:
# результат запроса
df = pd.read_sql(query_6_1, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\3341134701.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [532]:
# текст запроса
query_6_2 = f'''select count(*)
                from vacancies 
                where 
                   ((name ilike '%data scientist%')
                   or (name ilike '%data science%')
                   or (name ilike '%исследователь данных%')
                   or ((name like '%ML%') and (name not ilike '%HTML%'))
                   or (name ilike '%machine leaning%') 
                   or (name ilike '%машинн%обучен%'))
                   and ((name ilike '%junior%')
                   or (experience = 'Нет опыта')
                   or (employment = 'Стажировка'))
             '''

In [533]:
# результат запроса
df = pd.read_sql(query_6_2, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1281827515.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [534]:
# текст запроса
query_6_3 = f'''select count(*)
                from vacancies 
                where 
                    ((name ILIKE '%data scientist%') 
                    OR (name ILIKE '%data science%') 
                    OR (name ILIKE '%исследователь данных%')
                    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
                    OR (name ILIKE '%machine learning%')
                    OR (name ILIKE '%машинн%обучен%')
                    AND (key_skills IS NOT NULL))
                    AND ((key_skills LIKE '%SQL%')
                    OR (key_skills ILIKE'%postgres%'))
             '''

In [535]:
# результат запроса
df = pd.read_sql(query_6_3, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\1139984613.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [536]:
# текст запроса
query_6_4 = f'''select count(*)
                from vacancies 
                where 
                    ((name ILIKE '%data scientist%') 
                    OR (name ILIKE '%data science%') 
                    OR (name ILIKE '%исследователь данных%')
                    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
                    OR (name ILIKE '%machine learning%')
                    OR (name ILIKE '%машинн%обучен%')
                    AND (key_skills IS NOT NULL))
                    AND (key_skills ILIKE '%python%')
            '''

In [537]:
# результат запроса
df = pd.read_sql(query_6_4, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2391398652.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [538]:
# текст запроса
query_6_5 = f'''select round(AVG(length(key_skills) - length(replace(key_skills, chr(9), '')) + 1), 2)
                from vacancies 
                where 
                    ((name ILIKE '%data scientist%') 
                    OR (name ILIKE '%data science%') 
                    OR (name ILIKE '%исследователь данных%')
                    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
                    OR (name ILIKE '%machine learning%')
                    OR (name ILIKE '%машинн%обучен%')
                    AND (key_skills IS NOT NULL))
            '''

In [539]:
# результат запроса
df = pd.read_sql(query_6_5, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2266167861.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [540]:
# текст запроса
query_6_6 = f'''select 
                     experience "Опыт работы",
                     round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0) "Средняя зарплата"
                from vacancies 
                where 
                    ((name ILIKE '%data scientist%') 
                    OR (name ILIKE '%data science%') 
                    OR (name ILIKE '%исследователь данных%')
                    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
                    OR (name ILIKE '%machine learning%')
                    OR (name ILIKE '%машинн%обучен%'))
                    AND ((salary_from IS NOT NULL) OR (salary_to IS NOT NULL))
                group by 1
            '''

In [541]:
# результат запроса
df = pd.read_sql(query_6_6, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2018426997.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_6_6, connection)

          Опыт работы  Средняя зарплата
0           Нет опыта           74643.0
1  От 1 года до 3 лет          139675.0
2       От 3 до 6 лет          243115.0

***

In [542]:
# выводы по предметному анализу
# По результатам предметного анализа в аспекте требований работодателей к потенциальным дата-сайентистам можно заключить следующее:
# 1. Общее число вакансий, имеющих отношение к данным, составляет 1 771 вакансию.
# 2. Из них для начинающего дата-сайентиста может подойти 51 вакансия.
# 3. Из общего количества вакансий для дата-сайентистов в качестве ключевого навыка указано умение работать в SQL или Postgres указано в 201 вакансии.
# 4. Аналогично, умение работать в Python указано в 351 вакансии.
# 5. В среднем для потенциального дата-сайентиста необходимы  более 6 (6,41) профессиональных навыка.
# 6. Средняя заработная плата закономерно увеличивается пропорционально опыту работы от 74 643 руб. без опыта работы до 243 115 руб. с опытом работы от 3 до 6 лет.

# Общий вывод по проекту

In [543]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

# Дополнительные исследования

Распределение ТОП-10 популярных вакансий по городам-миллионикам.

In [544]:
# код для получения списка городов-милионников (2-ой способ с помощью BeautifulSoup)
# импортируем библиотеки
from bs4 import BeautifulSoup
import requests
import pandas as pd

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8' # ссылка на необходимую статью
soup = BeautifulSoup(url, 'lxml') # извлекаем документ по ссылке
cities = [] # создаем пустой список городов
table = BeautifulSoup(response.text, 'html.parser').find_all('table')[1] # сохраняем таблицу из документа
rows = table.select("#mw-content-text > div > table.standard.sortable > tbody> tr")[1:] # выделяем строки из таблицы, исключая заголовки
cities.append([row('td')[1].get_text(strip=True) for row in rows]) # добавляем в пустой список названия городов-миллиоников по индексам в строках
print(cities)

[['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград']]

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2018526547.py:8: MarkupResemblesLocatorWarning: The input looks more like a URL than markup. You may want to use an HTTP client like requests to get the document behind the URL, and feed that document to Beautiful Soup.
  soup = BeautifulSoup(url, 'lxml') # извлекаем документ по ссылке

In [545]:
# найдем ТОП-10 самых популярных вакансий
query_TOP_10 = f'''select name "название вакансии",
                       count(*) "количество вакансий"
                from vacancies v
                group by 1
                order by 2 desc
                limit 10
             '''

In [546]:
df_TOP_10 = pd.read_sql(query_TOP_10, connection)
df_TOP_10

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2540051568.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_TOP_10 = pd.read_sql(query_TOP_10, connection)

                  название вакансии  количество вакансий
0           Системный администратор                 1761
1                    Программист 1С                 1153
2                   Бизнес-аналитик                  488
3  Специалист технической поддержки                  457
4                Системный аналитик                  432
5                          Аналитик                  404
6               Инженер-программист                  389
7                    Программист 1C                  360
8              Frontend-разработчик                  242
9     Инженер технической поддержки                  230

In [547]:
# извлечем данные о вакансиях в аспекте популярности и региона
query = f'''select a.name "город",
                   v.name "название вакансии",
                   count(v.id) "количество вакансий"
                from vacancies v
                    join employers e on e.id = v.employer_id
                    join areas a on a.id = v.area_id
                group by 1, 2 
                having a.name in {cities_mln} and v.name in {'Системный администратор', 'Программист 1С', 'Бизнес-аналитик', 'Специалист технической поддержки', 'Системный аналитик', 'Аналитик', 'Инженер-программист', 'Программист 1С', 'Frontend-разработчик', 'Инженер технической поддержки'}
                
'''

In [548]:
df = pd.read_sql(query, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\238307580.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, connection)

         город                 название вакансии  количество вакансий
0    Волгоград              Frontend-разработчик                    1
1    Волгоград                          Аналитик                    4
2    Волгоград                   Бизнес-аналитик                    3
3    Волгоград               Инженер-программист                    5
4    Волгоград     Инженер технической поддержки                    2
..         ...                               ...                  ...
138  Челябинск     Инженер технической поддержки                    1
139  Челябинск                    Программист 1С                   29
140  Челябинск           Системный администратор                   30
141  Челябинск                Системный аналитик                    7
142  Челябинск  Специалист технической поддержки                    2

[143 rows x 3 columns]

Количество вакансий DS, предполагающих удаленный тип работы.

In [549]:
query_7_2 = f'''select count(*)
                from vacancies 
                where 
                   ((name ilike '%data scientist%')
                   or (name ilike '%data science%')
                   or (name ilike '%исследователь данных%')
                   or ((name like '%ML%') and (name not ilike '%HTML%'))
                   or (name ilike '%machine leaning%') 
                   or (name ilike '%машинн%обучен%'))
                   and ((schedule = 'Удаленная работа') or (schedule = 'Удалённая работа') or (schedule = 'удаленная работа') or (schedule = 'удалённая работа'))
            '''

In [550]:
df = pd.read_sql(query_7_2, connection)
df

C:\Users\bogda\AppData\Local\Temp\ipykernel_14196\2482809156.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query_7_2, connection)

   count
0    107

# Выводы

На основании анализа данной выборки представленной 49 197 вакансиями от 23 501 работодателя из 1 362 регионов России и других стран можно сделать следующие выводы:

1. Количественное распределение вакансий по регионам прямо пропорционально численности населения в данных регионах, о чем свидетельствуют результаты задания 4.1.

2. Однако структура вакансий (наименование профессии и, соответственно, заработная плата, тип занятости и прочее) уже не так сильно зависят от размера города и могут  различаться даже в городах-миллиониках (дополнительные исследования).

3. Самые распространенные вакансии представлены профессиями из сферы IT (дополнительные исследования). В частности, дата-сайентисты (юнит 6).

4. Что касается работодателей, то основная доля предложений приходится на крупные оргнанизации, такие как Яндекс, с широкой географией распространения и несколькими сферами деятельности.

5. Относительно дополнительных исследований, можно сказать, что помимо уточняющих аналитических исследований, стоит первоначально провести очистку данных. Так, представленная выборка содержит множество пропусков, некорректную информацию о регионах (например, регион "Россия" наряду с городами, находящимися также в Росии). Также при дополнительных исследованиях обнаружено, что в ТОП-10 популярных профессий "Программист 1С" входит 2 раза (1-е и 7-е места) с различным количеством вакансий.